<script setup>
import { ref, computed } from 'vue';
import { useRoute } from 'vue-router';

const route = useRoute();
const slug = computed(() => route.params.slug);
const steps = ref({
    target: [
        { name: "Заполнение брифа", description: "Бриф — это основа успешной рекламной кампании. Этот первый шаг помогает нам понять вашу бизнес-стратегию, цели и ценности бренда. Мы собираем все ключевые данные: кто ваша целевая аудитория, какие задачи стоят перед вами, какой бюджет вы готовы выделить. Именно бриф задает правильный вектор, чтобы реклама была максимально эффективной и отражала ваши ожидания. " },
        { name: "Анализ", description: "На этом этапе мы глубоко погружаемся в ваше исследование в электрическом режиме. Мы анализируем поведение, интересы, предпочтения, возраст, пол, географию и другие важные параметры. Также мы опираемся на ваших конкуренты, чтобы понять, как выделиться на фоне их рекламных тенденций. Анализ помогает нам выбрать самые эффективные источники, инструменты и методы таргетинга." },
        { name: "Подготовка", description: "На этапе разработки мы строим кризис. Мы выбираем рекламные платформы, на которых будет размещаться ваша реклама, настраиваемого аналитика, создаем необходимые аккаунты и подготавливаем все материалы для старта. Это также этап, на котором мы согласовываем с вами все ключевые моменты, чтобы быть уверенными, что каждый этап соответствует вашим ожиданиям." },
        { name: "Разработка", description: "Теперь начинается процесс создания самой рекламы. Мы разрабатываем креативы, пишем тексты и создаем визуальные материалы, которые привлекают внимание вашего клиента. На этом этапе важно, чтобы рекламные материалы были не только красивыми, но и эффективно коммуницировали ценности вашего бренда, работая над достижением ваших целей. Это тот момент, когда идея обретает конкретную форму." },
        { name: "Наполнение", description: "Здесь мы размещаем готовую рекламу на выбранных платформах и настраиваемый таргетинг. Мы определяем, кто видит вашу рекламу, с какими интересами, в каком возрасте, в каких странах. Важно, чтобы каждый элемент рекламы точно попадал в вашу целевую аудиторию. Мы тщательно отслеживаем процесс и вносим корректировки, если это необходимо." },
        { name: "Финал", description: "Реклама активирована, и мы начинаем следить за ее эффектом. На реальном этапе мы анализируем эффективность кампании: на данный момент точно сработал таргетинг, какие креативы привели к наибольшему отклику, какие механизмы приводят к наилучшему результату. Мы готовим отчет, который позволит вам увидеть реальную отдачу от вложений. Но на этом мы не останавливаемся — кампанию можно улучшить и сохранить для достижения еще больших результатов в будущем." },
    ],
    marketing: [
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
    ],
    website: [
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
        { name: "Заполнение брифа", description: "" },
    ],
    'get-course': [
        { name: "Заполнение брифа", description: "На первом этапе мы проводим консультации по определению целей курса. Важное понимание, какая задача определяет ваш курс, кто ваша целевая аудитория, какие знания или навыки должны быть переданы. Мы обсуждаем структуру курса, предполагаемое время обучения, а также требования к контенту. В результате брифа составила полное представление о содержании курса и его целях." },
        { name: "Анализ", description: "На этом этапе мы изучаем вашу целевую аудиторию, чтобы понять, какие знания ей уже известны, а какие нужно объяснить с нуля. Мы анализируем текущие тенденции в образовании, похожие курсы и материалы на рынке. Также соответствуют предпочтениям ваших форм обучения: видео, текста, квизов или практических заданий. Анализ позволяет определить, как лучше организовать подачу информации и сделать курс наиболее эффективным и востребованным." },
        { name: "Подготовка", description: "На этапе подготовки мы создаем структуру курса: разбиваем его на модули, определяем темы и ключевые моменты. Мы пишем сценарий для каждого урока, разрабатываем презентации, инфографику и другие наглядные материалы, которые помогают усвоить информацию. Также подготавливаются технические аспекты: выбор платформы для размещения курсов, инструментов для записи и монтажа видеоуроков, создание материалов для тестирования знаний." },
        { name: "Разработка", description: "На этапе разработки мы начинаем создание основного контента: запись видеоматериалов, создание интерактивных заданий и тестов. Мы прорабатываем каждый урок, записываем видеоролики, практически дополняем упражнения, тесты для проверки учебных материалов и другие учебные материалы. Важно, чтобы каждый модуль курса был логично структурирован, понятен и интересен для учащихся." },
        { name: "Наполнение", description: "Этот этап включает в себя размещение всего контента на платформе, создание меньшей навигации, обучающих материалов и тестов, а также организацию обратной связи для поддержки. Мы также добавили дополнительные ресурсы, такие как полезные ссылки, дополнительные задания или форумы для обсуждений. Окончание курса включает в себя простые и логические материалы, которые помогут учащимся легко ориентироваться и двигаться по курсу." },
        { name: "Финал", description: "Заключительный этап включает в себя проверку курса, сбор обратной связи и корректировки. Мы проверяем правильность всех материалов, а также рекомендации по их восприятию, чтобы убедиться, что они легко воспринимаются и дают результаты. После того как все материалы проверены и исправлены, курс готов к запуску. Мы анализируем отклики, чтобы определить, нужно ли внести дополнительные улучшения, а также подготовить для вас отчеты о безопасности и эффективности курса." },
    ],
    bot: [
        { name: "Заполнение брифа", description: "Для успешного старта проекта важно понять ваши потребности и цели. Бриф помогает собрать ключевую информацию: задачи, целевую аудиторию, основные функции и пожелания к дизайну. Заполнять бриф можно самостоятельно или с нашим специалистом. Чем точнее вы опишете свои ожидания, тем быстрее и качественнее мы разработаем вашего бота." },
        { name: "Анализ", description: "После получения брифа наши специалисты проводят анализ вашего бизнеса, целевой аудитории и конкурентов. Это позволяет определить, какие решения будут наиболее эффективными. Мы также оцениваем технические требования и возможности интеграции с другими системами." },
        { name: "Подготовка", description: "На этапе подготовки мы разрабатываем сценарии взаимодействия пользователя с ботом, создаём прототипы интерфейса и согласовываем дизайн. Все детали тщательно прорабатываються, чтобы будущий бот был не только функциональным, но и удобным для использования." },
        { name: "Разработка", description: "Здесь начинается техническая реализация проекта. Мы пишем код, настраиваем функционал, интегрируем бота с CRM, платёжными системами или другими сервисами. Каждый этап разработки тестируется, чтобы исключить возможные ошибки." },
        { name: "Наполнение", description: "На этом этапе мы добавляем в бота всё необходимое: тексты, изображения, кнопки, команды и другие элементы. Контент создаётся с учётом удобства пользователей и задач бизнеса. После наполнения бот становится полностью готов к использованию." },
        { name: "Финал", description: "После успешного тестирования и окончательной доработки бот запускается в эксплуатацию. Мы проводим обучение ваших сотрудников работе с ботом, предоставляем инструкции и сопровождаем проект на этапе запуска. При необходимости обеспечиваем техническую поддержку для стабильной работы бота." }

    ]
});

</script>
<template>
    <section>
        <h2>Этапы разработки</h2>
        <div class="steps-container">
            <div class="steps-container_item" v-for="step in steps[slug]" :key="step.name">
                <div class="steps-container_item-info">
                    <h3 class="steps-container_item-name">{{ step.name }}</h3>
                    <p class="steps-container_item-description">{{ step.description }}</p>
                </div>
                <div class="steps-container_item-divider"></div>
            </div>
        </div>
    </section>
</template>
<style lang="scss" scoped>
h2 {
    text-align: center;
}
h3 {
    color: #CAA153
}
.steps-container {
    margin: 100px auto 0 auto;
    width: 50%;

    &_item {
        display: flex;
        text-align: right;
        width: 50%;
        margin-right: auto;

        .steps-container_item-info {
            margin-right: 50px;
        }

        &:nth-child(even) {
            margin: 50px 3.8px 50px auto;
            text-align: left;
            flex-direction: row-reverse;
            justify-content: end;

            .steps-container_item-info {
                margin-right: 0px;
                margin-left: 50px;
            }
        }

        &-divider {
            display: flex;
            height: auto;
            width: 50px;
            background: #1B1B1C;
            box-shadow: 1px 1px 2px rgba(40, 40, 42, 0.3), -1px -1px 2px rgba(14, 14, 14, 0.5), inset -5px 5px 10px rgba(14, 14, 14, 0.2), inset 5px -5px 10px rgba(14, 14, 14, 0.2), inset -5px -5px 10px rgba(40, 40, 42, 0.9), inset 5px 5px 13px rgba(14, 14, 14, 0.9);
            border-radius: 15px;
            //margin-left: 50px;
        }
    }
}</style>
