<script setup>
import { ref, computed } from 'vue';
import { useRoute } from 'vue-router';
import Accordion from '../Accordion.vue';
const items = ref([
  { title: 'Пасадочная страница', content: 'Идеальна для продвижения одного продукта или услуги. Помогает привлечь внимание, заинтересовать и стимулировать клиента к действию (например, оставить заявку или купить).', isOpen: true },
  { title: 'Cайт визитка', content: 'Отличный выбор для малого бизнеса или специалистов. Содержит основную информацию о вас, ваши контакты и ключевые преимущества, чтобы потенциальные клиенты могли легко найти и связаться с вами.', isOpen: false },
  { title: 'Многостраничный сайт', content: ' Подходит для крупных проектов, интернет-магазинов или компаний с широким спектром услуг. Сайты такого типа позволяют структурировать информацию и улучшить пользовательский опыт.', isOpen: false },
  { title: 'Платформа', content: 'Это сложные система, такая как онлайн-школа, маркетплейс или сервис с индивидуальными настройками. Помогает организовать бизнес-процессы и взаимодействие с клиентами.', isOpen: false }
]);
const route = useRoute();
const slug = computed(() => route.params.slug);
const steps = ref({
    target: [
        { title: "Заполнение брифа", content: "Бриф — это основа успешной рекламной кампании. Этот первый шаг помогает нам понять вашу бизнес-стратегию, цели и ценности бренда. Мы собираем все ключевые данные: кто ваша целевая аудитория, какие задачи стоят перед вами, какой бюджет вы готовы выделить. Именно бриф задает правильный вектор, чтобы реклама была максимально эффективной и отражала ваши ожидания. " },
        { title: "Анализ", content: "На этом этапе мы глубоко погружаемся в ваше исследование в электрическом режиме. Мы анализируем поведение, интересы, предпочтения, возраст, пол, географию и другие важные параметры. Также мы опираемся на ваших конкуренты, чтобы понять, как выделиться на фоне их рекламных тенденций. Анализ помогает нам выбрать самые эффективные источники, инструменты и методы таргетинга." },
        { title: "Подготовка", content: "На этапе разработки мы строим кризис. Мы выбираем рекламные платформы, на которых будет размещаться ваша реклама, настраиваемого аналитика, создаем необходимые аккаунты и подготавливаем все материалы для старта. Это также этап, на котором мы согласовываем с вами все ключевые моменты, чтобы быть уверенными, что каждый этап соответствует вашим ожиданиям." },
        { title: "Разработка", content: "Теперь начинается процесс создания самой рекламы. Мы разрабатываем креативы, пишем тексты и создаем визуальные материалы, которые привлекают внимание вашего клиента. На этом этапе важно, чтобы рекламные материалы были не только красивыми, но и эффективно коммуницировали ценности вашего бренда, работая над достижением ваших целей. Это тот момент, когда идея обретает конкретную форму." },
        { title: "Наполнение", content: "Здесь мы размещаем готовую рекламу на выбранных платформах и настраиваемый таргетинг. Мы определяем, кто видит вашу рекламу, с какими интересами, в каком возрасте, в каких странах. Важно, чтобы каждый элемент рекламы точно попадал в вашу целевую аудиторию. Мы тщательно отслеживаем процесс и вносим корректировки, если это необходимо." },
        { title: "Финал", content: "Реклама активирована, и мы начинаем следить за ее эффектом. На реальном этапе мы анализируем эффективность кампании: на данный момент точно сработал таргетинг, какие креативы привели к наибольшему отклику, какие механизмы приводят к наилучшему результату. Мы готовим отчет, который позволит вам увидеть реальную отдачу от вложений. Но на этом мы не останавливаемся — кампанию можно улучшить и сохранить для достижения еще больших результатов в будущем." },
    ],
    marketing: [
        { title: "Заполнение брифа", content: "Зачем это нужно?Заполнение брифа — это первый и самый важный шаг в работе с клиентом. Мы подробно обсуждаем с вами цели, задачи, аудиторию, особенности бизнеса и ожидания от маркетинговой стратегии. Мы задаем конкретные вопросы, чтобы выяснить ключевые моменты, которые помогут нам выйти к максимально подходящему результату  для вашего бизнеса. Что это дает нам и клиенту? Этот этап дает нам четкое понимание вашего настроения, а вам — уверенность в том, что мы точно понимаем ваш бизнес и его цели. Заполнение брифа позволяет избежать недоразумений по следующим аспектам, а также спланировать обе стороны на совместную работу и конкретные результаты." },
        { title: "Анализ", content: "Зачем это нужно? Анализ рынка, конкурентность и надежность — это основа любой эффективной стратегии. Мы корректируем возможные ошибки в вашей нишу, изучаем тенденции, поведение ваших клиентов и выявляем сильные стороны вашего бизнеса, а также возможные точки роста. Что это дает нам и клиенту? Для нас этот этап позволяет построить точную и неправильную посадку. Для вас это гарантирует, что наш подход будет основан на данных, а не на догадках. Мы выявляем, какие связи работают в вашей отрасли, какие методы продвижения наиболее  эффективны, что нужно для того, чтобы выделиться среди конкурентов." },
        { title: "Подготовка", content: "Что мы будем делать? На этапе подготовки мы создаем план действий: что конкретно мы будем делать, какие маркетинговые инструменты мы будем использовать (SEO, SMM, таргетированная реклама и другие), а также как распределять бюджет для максимальной эффективности. Мы также определяем ключевые показатели успеха (KPI), которые позволяют лучше отслеживать результаты на каждом этапе. Как мы принимаем решения? Все решения принимаются на основе готовой информации на предыдущем этапе. Мы ориентируемся на анализ данных и выбираем те методы и средства продвижения, которые подходят именно для вашего бизнеса. Также учитываем пожелания и специфику вашего рынка, чтобы все было максимально эффективно." },
        { title: "Разработка", content: "Почему это важно? Это ключевой этап, на котором начинается настоящая работа. Мы создаем все необходимые креативы (рекламные баннеры, текстовые и видеоматериалы, контент для соцсетей и рекламных кампаний), разрабатываем рекламные стратегии, настраиваемую таргетированную рекламу и контекстную рекламу. Что это дает нам и клиенту? Для нас — это создание качественного контента, который будет привлекать внимание и мотивировать к проведению. Для вас — это гарантированный результат, потому что весь контент и стратегии настраиваются под вашу целевую аудиторию и бизнес. Мы также активно тестируем различные рекламные материалы, чтобы подобрать оптимальные варианты." },
        { title: "Наполнение", content: "На этом этапе мы начинаем наполнять контент контентом, который поможет вашему бизнесу привлекать внимание потенциальных клиентов. Это может быть контент для социальных сетей, создание рекламных материалов, запуск email-рассылок, создание креативов и лид магнитов и так же много чего другого. Мы следим за реакцией, предотвращаем  предсказуемость и, при необходимости, корректируемым всевозможные ошибки и недоработки. Как это работает? Каждый элемент контента — будь то текст, изображение или видео — тщательно продумывается и адаптируется под нужды вашего бизнеса. Мы анализируем результаты и корректно вносим изменения, чтобы обеспечить эффективность всех наших действий. Все это помогает поддерживать активный интерес к вашему бренду и повышает вероятность конверсии." },
        { title: "Финал", content: "Какой результат мы получим? По завершении кампании мы проводим подробный анализ всех результатов. Мы измеряем показатели: конверсии, рентабельность инвестиций (возврат инвестиций), уровень доступности и другие ключевые метрики. Также мы подготавливаем отчет, в котором показываем, как достигнуты поставленные цели и какие результаты были получены за период сотрудничества. Что будет альтернативно? Результат будет не просто хорошим, а выдающимся. Мы гарантируем, что ваш проект с нашей маркетинговой помощью принисет реальные результаты: рост продаж, увеличение клиентской базы и повышение узнаваемости бренда. Мы настроены на долгосрочный успех, и результат, который мы получаем, в 99% случаев превосходит наши ожидания. Мы всегда уверены, что предложенные решения будут работать." },
    ],
    explainer: [
        { title: "Заполнение брифа", content: "На этом этапе мы собираем всю необходимую информацию для создания эксплейнера. Мы задаем вопросы, которые помогают нам понять ключевые моменты: что именно нужно объяснить, кому будет адресовано сообщение, какие особенности продукта или услуги должны быть приоритетными. Это поможет нам определить стиль, тон и содержание видео, а также выстроить общий подход." },
        { title: "Анализ", content: "В процессе анализа мы изучаем вашу целевую аудиторию, ее внешний вид и предпочтения. Мы анализируем, что важно для вашего бизнеса, какие проблемы необходимо решить, и как ваш продукт или услуга могут помочь. Также мы анализируем конкуренты, чтобы выявить основные преимущества ваших предложений. Это позволит создать такой эксплейнер, который будет понятен и актуален для использования в сети." },
        { title: "Подготовка", content: "На этапе подготовки мы начинаем работать над сценарием. Мы пишем текст, который будет рассказывать о продукте или объяснять понятно и кратко. Мы решаем, какие важные моменты нужно выделить, какие визуальные элементы лучше всего подходят для пояса, и как сделать эксплейнер увлекательным и запоминающимся. Подготовка также включает в себя выбор стиля, графики, анимации и других визуальных элементов." },
        { title: "Разработка", content: "На этом этапе мы начинаем создавать сам эксплейнер. Мы записываем озвучку, анимируем график, создаем сцены и переходы. Разработка включает в себя создание всех визуальных и аудио-элементов, которые будут использоваться в видео. Мы делаем упор на простоту и наглядность, чтобы каждое сообщение было легко воспринимаемо. Важно, чтобы видео сочетало информацию и эмоции, чтобы зритель не только понял, но и запомнил вашу идею." },
        { title: "Наполнение", content: "На этапе заполнения мы завершаем работу над эксплейнером. Мы создаем штрихи: синхронизируем озвучку с анимацией, проверяем, как все элементы работают вместе, чтобы передать информацию максимально эффективно. В этом процессе мы также работаем над цветовой гаммой, шрифтами и деталями, которые делают видео более красивыми и профессиональными." },
        { title: "Финал", content: "На последнем этапе мы подготавливаем готовое видео для передачи или размещения. Мы проверяем его на наличие ошибок и убеждаемся, что все идеально работает. Также мы анализируем, хорошо эксплейнер выполняет свою задачу — мгновенно, информирует и привлекает внимание. В случае необходимости мы вносим последние изменения, чтобы окончательная версия полностью отобразила ваши ожидания." },
    ],
    website: [
        { title: "Заполнение брифа", content: "Бриф — это ключевой документ, который помогает определить цели проекта, целевую аудиторию и основные задачи. Мы просим клиента заполнить бриф, чтобы понять: какие функции должен выполнять сайт? какой стиль и дизайн предпочитается? какие элементы необходимо включить (формы, каталоги, интеграции)? Это первый шаг к созданию сайта, который будет отвечать потребностям бизнеса. Если заполнение брифа вызывает вопросы, наши специалисты помогут сделать это быстро и просто." },
        { title: "Анализ", content: "После получения брифа мы проводим глубокий анализ: исследуем целевую аудиторию и её потребности, оцениваем рынок и конкурентов, определяем оптимальную структуру сайта и функционал. Этот этап позволяет нам сформировать чёткое понимание того, как ваш сайт должен выглядеть и работать." },
        { title: "Подготовка", content: "На этапе подготовки мы: cоздаём прототипы страниц, чтобы визуализировать структуру. Разрабатываем дизайн с учётом предпочтений клиента и современных тенденций. Согласовываем все элементы проекта перед началом разработки. Результат этого этапа — чёткий план и дизайн, готовые к реализации." },
        { title: "Разработка", content: "Основной этап, где идея превращается в реальность: создание фронтенда (внешнего интерфейса), настройка бэкенда (внутренней системы управления), интеграция с необходимыми сервисами (CRM, платёжные системы, мессенджеры). Мы тестируем сайт на каждом шаге, чтобы убедиться в его стабильности и корректной работе." },
        { title: "Наполнение", content: "Ваш сайт оживает благодаря качественному контенту: добавляем тексты, изображения, видео и другие элементы, настраиваем SEO-оптимизацию для улучшения видимости в поисковых системах, проверяем, чтобы весь контент был удобен для восприятия и соответствовал бренду." },
        { title: "Финал", content: "После завершения разработки мы: проводим финальное тестирование и исправляем мелкие недочёты, настраиваем аналитику для отслеживания посещений и конверсий, запускаем сайт в продакшн и обеспечиваем техническую поддержку." },
    ],
    'get-course': [
        { title: "Заполнение брифа", content: "На первом этапе мы проводим консультации по определению целей курса. Важное понимание, какая задача определяет ваш курс, кто ваша целевая аудитория, какие знания или навыки должны быть переданы. Мы обсуждаем структуру курса, предполагаемое время обучения, а также требования к контенту. В результате брифа составила полное представление о содержании курса и его целях." },
        { title: "Анализ", content: "На этом этапе мы изучаем вашу целевую аудиторию, чтобы понять, какие знания ей уже известны, а какие нужно объяснить с нуля. Мы анализируем текущие тенденции в образовании, похожие курсы и материалы на рынке. Также соответствуют предпочтениям ваших форм обучения: видео, текста, квизов или практических заданий. Анализ позволяет определить, как лучше организовать подачу информации и сделать курс наиболее эффективным и востребованным." },
        { title: "Подготовка", content: "На этапе подготовки мы создаем структуру курса: разбиваем его на модули, определяем темы и ключевые моменты. Мы пишем сценарий для каждого урока, разрабатываем презентации, инфографику и другие наглядные материалы, которые помогают усвоить информацию. Также подготавливаются технические аспекты: выбор платформы для размещения курсов, инструментов для записи и монтажа видеоуроков, создание материалов для тестирования знаний." },
        { title: "Разработка", content: "На этапе разработки мы начинаем создание основного контента: запись видеоматериалов, создание интерактивных заданий и тестов. Мы прорабатываем каждый урок, записываем видеоролики, практически дополняем упражнения, тесты для проверки учебных материалов и другие учебные материалы. Важно, чтобы каждый модуль курса был логично структурирован, понятен и интересен для учащихся." },
        { title: "Наполнение", content: "Этот этап включает в себя размещение всего контента на платформе, создание меньшей навигации, обучающих материалов и тестов, а также организацию обратной связи для поддержки. Мы также добавили дополнительные ресурсы, такие как полезные ссылки, дополнительные задания или форумы для обсуждений. Окончание курса включает в себя простые и логические материалы, которые помогут учащимся легко ориентироваться и двигаться по курсу." },
        { title: "Финал", content: "Заключительный этап включает в себя проверку курса, сбор обратной связи и корректировки. Мы проверяем правильность всех материалов, а также рекомендации по их восприятию, чтобы убедиться, что они легко воспринимаются и дают результаты. После того как все материалы проверены и исправлены, курс готов к запуску. Мы анализируем отклики, чтобы определить, нужно ли внести дополнительные улучшения, а также подготовить для вас отчеты о безопасности и эффективности курса." },
    ],
    bot: [
        { title: "Заполнение брифа", content: "Для успешного старта проекта важно понять ваши потребности и цели. Бриф помогает собрать ключевую информацию: задачи, целевую аудиторию, основные функции и пожелания к дизайну. Заполнять бриф можно самостоятельно или с нашим специалистом. Чем точнее вы опишете свои ожидания, тем быстрее и качественнее мы разработаем вашего бота." },
        { title: "Анализ", content: "После получения брифа наши специалисты проводят анализ вашего бизнеса, целевой аудитории и конкурентов. Это позволяет определить, какие решения будут наиболее эффективными. Мы также оцениваем технические требования и возможности интеграции с другими системами." },
        { title: "Подготовка", content: "На этапе подготовки мы разрабатываем сценарии взаимодействия пользователя с ботом, создаём прототипы интерфейса и согласовываем дизайн. Все детали тщательно прорабатываються, чтобы будущий бот был не только функциональным, но и удобным для использования." },
        { title: "Разработка", content: "Здесь начинается техническая реализация проекта. Мы пишем код, настраиваем функционал, интегрируем бота с CRM, платёжными системами или другими сервисами. Каждый этап разработки тестируется, чтобы исключить возможные ошибки." },
        { title: "Наполнение", content: "На этом этапе мы добавляем в бота всё необходимое: тексты, изображения, кнопки, команды и другие элементы. Контент создаётся с учётом удобства пользователей и задач бизнеса. После наполнения бот становится полностью готов к использованию." },
        { title: "Финал", content: "После успешного тестирования и окончательной доработки бот запускается в эксплуатацию. Мы проводим обучение ваших сотрудников работе с ботом, предоставляем инструкции и сопровождаем проект на этапе запуска. При необходимости обеспечиваем техническую поддержку для стабильной работы бота." }

    ]
});

</script>
<template>
    <section>
        <h2>Этапы разработки</h2>
        <div class="steps-accordion">
            <Accordion :items="steps[slug]" />
        </div>
        <div class="steps-container">
            <div class="steps-container_item" v-for="step in steps[slug]" :key="step.title">
                <div class="steps-container_item-info">
                    <h3 class="steps-container_item-name">{{ step.title }}</h3>
                    <p class="steps-container_item-description">{{ step.content }}</p>
                </div>
                <div class="steps-container_item-divider"></div>
            </div>
        </div>
    </section>
</template>
<style lang="scss" scoped>
h2 {
    text-align: center;
}

h3 {
    color: #CAA153
}
.steps-accordion {
    display: none;
}
.steps-container {
    margin: 100px auto 0 auto;
    width: 60%;

    &_item {
        display: flex;
        text-align: right;
        width: 50%;
        margin-right: auto;

        .steps-container_item-info {
            margin-right: 50px;
        }

        &:nth-child(even) {
            margin: 50px 3.8px 50px auto;
            text-align: left;
            flex-direction: row-reverse;
            justify-content: end;

            .steps-container_item-info {
                margin-right: 0px;
                margin-left: 50px;
            }
        }

        &-divider {
            display: flex;
            height: auto;
            width: 50px;
            background: #1B1B1C;
            box-shadow: 1px 1px 2px rgba(40, 40, 42, 0.3), -1px -1px 2px rgba(14, 14, 14, 0.5), inset -5px 5px 10px rgba(14, 14, 14, 0.2), inset 5px -5px 10px rgba(14, 14, 14, 0.2), inset -5px -5px 10px rgba(40, 40, 42, 0.9), inset 5px 5px 13px rgba(14, 14, 14, 0.9);
            border-radius: 15px;
        }
    }
}
@media screen and (max-width: 1440px) {
    .steps-container {
        width: 80%;
    }
}
@media screen and (max-width: 900px) {
    .steps-container {
        display: none;
    }
    .steps-accordion {
        display: flex;
    }
}
</style>
